app/views/trips/_form.html.erb

  <%= f.text_field :name %><br>
  <%= f.collection_select(:user_id, User.all, :id, :name) %>
  <%= f.collection_select(:trip_desination, City.all, :id, :name) %>
---
SELECT "users".* FROM "users"
SELECT "cities".* FROM "cities"