app/views/countries/show.html.erb


<strong> Cities: <% @country.country_cities.each do |city|%>
---
SELECT "cities".* FROM "cities" WHERE "cities"."country_id" = ?  [["country_id", 3]]