app/controllers/cities_controller.rb

  def index
    @cities = City.all
---
SELECT "cities".* FROM "cities" WHERE (country_id.name LIKE '%United Kingdom\%%')

  def show
    @city = City.find(params[:id])
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def search
    @country = Country.find_by(name: params[:q])
---
SELECT  "countries".* FROM "countries" WHERE "countries"."name" = ? LIMIT ?  [["name", "United Kingdom"], ["LIMIT", 1]]