app/controllers/city_trips_controller.rb

    def show
        @city_trip = CityTrip.find(params[:id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "city_trips".* FROM "city_trips" WHERE "city_trips"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

    def new
        trip_id = params[:format]
        @trip = Trip.find(trip_id)
---
SELECT  "city_trips".* FROM "city_trips" WHERE "city_trips"."trip_id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 44], ["LIMIT", 1]]

    def create
        @city_trip = CityTrip.new(trip_id: params[:city_trip][:trip_id], city_id: params[:city_trip][:city_id])

        if @city_trip.save
---
INSERT INTO "city_trips" ("trip_id", "city_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["trip_id", 53], ["city_id", 29], ["created_at", "2019-05-10 09:41:55.046893"], ["updated_at", "2019-05-10 09:41:55.046893"]]

    def edit
        @city_trip = CityTrip.find(params[:id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 53], ["LIMIT", 1]]
SELECT  "city_trips".* FROM "city_trips" WHERE "city_trips"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]

    def update
        @city_trip = CityTrip.find(params[:id])
        @trip = @city_trip.trip

        @city_trip.update(city_id: params[:city_trip][:city_id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 53], ["LIMIT", 1]]
SELECT  "city_trips".* FROM "city_trips" WHERE "city_trips"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
UPDATE "city_trips" SET "city_id" = ?, "updated_at" = ? WHERE "city_trips"."id" = ?  [["city_id", 31], ["updated_at", "2019-05-10 10:01:24.131586"], ["id", 25]]

    def destroy
      city_trip = CityTrip.find(params[:id])
      city_trip.destroy
---
SELECT  "city_trips".* FROM "city_trips" WHERE "city_trips"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
DELETE FROM "city_trips" WHERE "city_trips"."id" = ?  [["id", 25]]