app/controllers/city_trips_controller.rb

    def index
        @city_trips = CityTrip.all
---
SELECT  "city_trips".* FROM "city_trips" ORDER BY "city_trips"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "trips".* FROM "trips"