app/controllers/countries_controller.rb

SELECT "countries".* FROM "countries"
---
    def index
        @countries = Country.all

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @country = Country.find(params[:id])