app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Rebecca"], ["LIMIT", 1]]
---
  def login
    user = User.find_by(username: params[:user][:username])