app/controllers/trips_controller.rb

  def show
    @trip = Trip.find(params[:id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def create
      @trip = Trip.new(name: params[:trip][:name], user_id: session[:user_id])
      if @trip.save
---
INSERT INTO "trips" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Birthday Vacay"], ["user_id", 11], ["created_at", "2019-05-07 14:13:54.215251"], ["updated_at", "2019-05-07 14:13:54.215251"]]

  def edit
      @trip = Trip.find(params[:id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]

  def update
      trip = Trip.find(params[:id])
      trip.update(name: params[:trip][:name], user_id: session[:user_id])
      if trip.save
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
UPDATE "trips" SET "name" = ?, "updated_at" = ? WHERE "trips"."id" = ?  [["name", "Holidais"], ["updated_at", "2019-05-09 14:20:49.268651"], ["id", 27]]
UPDATE "trips" SET "user_id" = ?, "updated_at" = ? WHERE "trips"."id" = ?  [["user_id", 12], ["updated_at", "2019-05-07 14:34:22.026491"], ["id", 24]]

  def destroy
      @trip = Trip.find(params[:id])
      @trip.destroy
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
DELETE FROM "trips" WHERE "trips"."id" = ?  [["id", 28]]