app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        authorized_for(params[:id])
        @user = User.find(params[:id])

INSERT INTO "users" ("username", "bio", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)
---
    def create
        @user = User.new(user_params)
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def edit
        authorized_for(params[:id])
        @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$XQvHxSu7g57bCH3NUIiQYug.40ndIQAygP7STL8VtsME3bZCHtwRW"], ["updated_at", "2019-05-09 15:14:22.812310"], ["id", 2]]
---
    def update
        @user = User.find(params[:id])

        @user.update(user_params)