app/models/city_trip.rb

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
SELECT "city_trips".* FROM "city_trips"
---
  def self.my_trips(user_id)
    self.all.select { |ct| ct.trip.user_id == user_id }