app/models/country.rb

SELECT "cities".* FROM "cities" WHERE "cities"."country_id" = ?  [["country_id", 3]]
---
  def country_cities
    self.cities.map {|city| city }