app/models/trip.rb

SELECT "cities".* FROM "cities" INNER JOIN "city_trips" ON "cities"."id" = "city_trips"."city_id" WHERE "city_trips"."trip_id" = ?  [["trip_id", 20]]
---
  def trip_desination
    self.cities.map {|city| city }